import Card from "../components/Card";

export const companiesData = {
  group_name: "مجموعة شركات اقتصادية مصرية",
  about: {
    description:
      "تأسست 'مجموعة' MRG على يد رجل المجتمع الأستاذ/ محمود رمضان، لتصبح اليوم خيالاً اقتصادياً مصرياً يوافق تطورات العصر ويلبي احتياجات المجتمع المتغيرة. تضم المجموعة أكثر من 14 شركة تعمل في مختلف القطاعات وبأكثر من 700 موظف، وقد تأسست بعض شركات المجموعة منذ 20 عاماً، وأضيفت شركات جديدة لمواكبة مستجدات الحياة وتطلعات الأفراد. تهدف المجموعة إلى تنمية الفرد والمجتمع عبر تقديم خدمات ومنتجات مبتكرة ومتنوعة تشمل الترفيه، التكنولوجيا، النشر، الرعاية، والتدريب، إسهاماً منها في رفع مستوى الوعي والمعرفة، وتحسين جودة الحياة، وتعزيز نمو الأعمال. تلتزم المجموعة التزاماً عميقاً بالمسؤوليات الأخلاقية والمجتمعية، مؤدية دورها الاجتماعي الرائد.",
    website: "www.mrgeg.com",
    address: "82 Makram Ebeid - Nasr City - 11th floor",
  },
  // "vision": "أن نكون رائدين في تقديم خدمات ومنتجات متنوعة ومتكاملة مع التزامنا بأعلى معايير الجودة والابتكار والمسؤولية الاجتماعية، ليكون لنا أثر إيجابي في كافة القطاعات التي تعمل بها محلياً ودولياً.",
  goals: [
    "توسيع نطاق التأثير: تقديم منتجات وخدمات مبتكرة تواجه التحولات التكنولوجية وتلبي احتياجات الأسواق المحلية والدولية.",
    "التميز في الجودة: تحقيق التميز في كافة مجالات العمل من خلال تقديم خدمات عالية الجودة مع الالتزام بأعلى معايير الاحترافية.",
    "تعزيز الاستدامة: تبني ممارسات مستدامة تدعم التنمية الاقتصادية والاجتماعية والبيئية.",
    "تنمية وتطوير الكوادر البشرية: الاستثمار في تدريب وتطوير فرق العمل لضمان تقديم أفضل ما لديهم من إبداع وكفاءة.",
    "المسؤولية الاجتماعية: الالتزام بدعم الفئات الأكثر احتياجاً من خلال مؤسسة رمضان الاقتصادية لدعم الأسرة، مع تقديم مبادرات مجتمعية فعالة تساهم في تحسين نوعية الحياة.",
    "تعزيز التكامل: توفير حلول متكاملة ومتزامنة، تجمع بين التكنولوجيا، التدريب، والخدمات، مما يعزز قيمة العملاء.",
  ],
  chairman: {
    name: "محمود رمضان",
    birth_year: 1968,
    education: "ليسانس حقوق وماجستير في القانون من جامعة عين شمس",
    roles: [
      "مؤسس ورئيس مجلس إدارة مجموعة شركات MRG التي تضم شركات صناعية وزراعية وتجارية وشركات للتدريب والنشر والرياضة.",
      "مؤسس ورئيس مجلس إدارة مؤسسة رمضان للتنمية الاقتصادية وهي مؤسسة خيرية.",
      "عضو اتحاد الناشرين المصريين واتحاد الناشرين العرب.",
      "عضو اتحاد الصناعات المصرية.",
      "عضو الجمعية المصرية للاقتصاد السياسي والإحصاء والتشريع.",
      "عضو مجلس إدارة الأعمال الخيري.",
      "عضو الغرفة التجارية بالقاهرة.",
    ],
    website: "www.mahmoudramadan.com",
    published_books: [
      "الشعب يريد نظام جديد.",
      "أي نعم مصر.",
      "مقالات ومقوالت.",
      "ظلم محمود.",
    ],
    quotes: ["لا أصبحت رئيساً لمصر.", "من أحلى كلام البشر.", "إحنا مش قنموت."],
  },
  companies: [
    {
      name: "دار طفرة للنشر والتوزيع",
      description:
        "نافذة ثقافية جديدة ومختلفة تهدف إلى تشجيع الإبداع وتنمية الفكر والوجدان من خلال إصدار محتوى عالي الجودة يدمج بين المتعة والفائدة، وإحياء التراث بصيغة عصرية ودعم التنمية البشرية.",
      phone: "012 777 59 680",
      website: "www.tafrabooks.com",
      goals: [
        "تقديم محتوى عالي الجودة الالتزام بأعلى معايير التحرير والإنتاج لتقديم كتب تجمع بين الإبداع والفائدة.",
        " إحياء التراث العربي: إعادة نشر الأعمال التراثية القيمة بأسلوب حديث يجعلها قريبة من اهتمامات الأجيال الحالية.",
        "دعم التنمية البشرية والتطوير المهني : إصدار كتب تهدف إلى تحسين مهارات الأفراد ورفع كفاءاتهم الشخصية والمهنية.",
        "معالجة القضايا المجتمعية: إنتاج كتب تسلط الضوء على قضايا المجتمع وتقدم حلولا عملية وفعالة تلبي إحتياجات المجتمع وتسهم في تطويره .",
        "تعزيز التوازن بين المتعة والفائدة نشر كتب أدبية ممتعة وأعمال فكرية عميقة تلبي احتياجات القارئ المختلفة.",
        " دعم الكتاب المميزين التعاون مع نخبة من الكتاب المبدعين والمفكرين لتقديم محتوى ثري وهادف.",
      ],
      img_url: "/mrg4.png",
      mission: [
        `في دار طفرة، نؤمن بقوة الكلمة وتعبيرها عن الفكرة في إحداث الفرق وبناء المستقبل ، وذلتزم بتقديم إصدارات تثري العقل وتلهم الروح وتعمق الفهم وكتب
تركز على تطوير الذات والمجتمع، مع الحرص على معالجة قضايا الواقع وتقديم حلول عملية تسهم في مواجهة تحدياته.`,
      ],
      vision: `أن تكون دار طفرة للنشر والتوزيع منصة رائدة في تقديم محتوى متنوع يجمع بين الإبداع والإفادة ويمزج بين جودة الأعمال الأدبية وقوة المحتوى الفكري ،
مع إحياء التراث العريق، بما يلبي احتياجات القارئ، ويرتقي بالفكر المصري والعربي ، ويسهم في بناء إنسان أكثر وعيا وكفاءة، ومجتمع أكثر تطورا `,
      email: "info@tafrabooks.com",
    },
    {
      name: "مران للاستثمار الرياضي",
      description:
        "هي مؤسسة رياضية متخصصة في تقديم برامج تدريبية متكاملة تستهدف الأطفال، الشباب، والكبار في مختلف الأكاديميات. تهدف الأكاديمية إلى تطوير المهارات الرياضية والبدنية لدى جميع الفئات العمرية من خلال مجموعة متنوعة من الأنشطة الرياضية التقليدية والمبتكرة.",
      values: [
        "الاحترافية: تقديم خدمات رياضية عالية الجودة وفقاً لأعلى المعايير.",
        "الجودة: تقديم حلول رياضية مبتكرة ومتطورة تلبي احتياجات العملاء.",
        "الالتزام: الوفاء بالوعود وتقديم خدمات متكاملة.",
        "تطوير المهارات: بيئة تدريبية تهدف إلى تعزيز المهارات الرياضية.",
        "التفوق والمنافسة: تشجيع التركيز على تحقيق أفضل أداء رياضي.",
        "العمل الجماعي: تعزيز روح الفريق والتعاون.",
      ],
      branches: [
        "مران 1: أرض الجولف بجوار مسجد البخاري - الشروق.",
        "مران 2: سكن مصر – الشروق.",
        "مران 3: كمبوند ماونتن فيو – الشروق.",
        "مران 4: العودة 11 شارع الكوتش أمام حلوان جيم بالمعز.",
        "مران 5: 219 شارع جسر السويس بجوار نادي الشمس أمام بوابة النادي الإداري.",
        "مران 6: شارع 157 متفرع من شارع مصطفى النحاس بجوار مدارس المنهل – مدينة نصر.",
        "مران 7: هايد بارك – التجمع الخامس.",
        "مران 8: شارع مكه مكرم متفرع من شارع مساكن، الهيئة العربية للتصنيع خلف سيتي سنتر.",
      ],
      goals: [
        "تدريب جميع الفئات لتطوير القدرات البدنية والمهارات عبر برامج رياضية متنوعة.",
        "تقديم بيئة تدريبية آمنة ومحفزة تناسب مختلف الفئات.",
        "توفير أنشطة رياضية مبتكرة في أماكن مختلفة بالقاهرة.",
        "فعاليات ترفيهية لتنظيم أيام وأنشطة مناسبة لجميع أفراد الأسرة.",
      ],
      img_url: "/mrg7.jpg",
      phone: "0155 114 66 29",
    },

    {
      name: "أكاديمية I Talant للتدريب والكورسات",
      description: `أكاديمية Talent | هي مركز تدريب رائد يقدم برامج شاملة ومتخصصة في مختلف المجالات الحياتية
المهنية، والعلمية. نسعى لتطوير المهارات وتأهيل الأفراد ليحققوا التميز في حياتهم الشخصية والمهنية
مع التركيز على الابتكار ومواكبة التطورات التكنولوجية.`,
      training_fields: [
        "التكنولوجيا والذكاء الاصطناعي.",
        "الصحة والتغذية.",
        "المهارات المهنية والشخصية.",
        "الهندسة والتخطيط.",
        "التصميم والجرافيك.",
      ],
      phone: "0155 11 47 441",
      goals: [
        "تقديم برامج تدريبية مبتكرة تواجه المتطلبات العلمية والتكنولوجية العالمية.",
        "تعزيز المهارات العملية المرتبطة بسوق العمل الخاص بالمتخصصين.",
        "إعداد كوادر مهنية متخصصة تضيف قيمة حقيقية للمجتمع.",
        "دعم الإبداع والبحث العلمي وتشجيع التفكير النقدي.",
        "تقديم خدمات تدريبية بمعايير عالية واحترافية.",
        "بناء شراكات مع مؤسسات دولية ومحلية لدعم برامجنا التدريبية.",
      ],
      img_url: "/cardmrg.jpg",
      vision:
        "أن نصبح الوجهة الأولى في التدريب والتطوير بمنطقة الشرق الأوسط، عبر بناء مجتمع مبدع ومتطور قادر على مواجهة تحديات المستقبل بفعالية وإبداع.",
      mission: [
        `نلتزم بتقديم برامج تدريبية متقدمة تجمع بين المعرفة العميقة والتطبيق العملي، بما يساعد المتدربين على اكتساب مهارات حديثة تؤهلهم للتفوق والريادة في مجالاتهم المختلفة.`,
      ],
    },
    {
      name: "مصنع PURE PLAST",
      description:
        "أحد رواد صناعة منتجات شيت PET ومواد التعبئة والتغليف في مصر، تأسس برؤية مصرية تركية مشتركة، معتمدا على أحدث تقنيات التشكيل الحراري والمواد الحديثة الصديقة للبيئة لتقديم حلول متكاملة تلبي احتياجات العملاء.",
      advantages: [
        "جودة متميزة بأسعار تنافسية.",
        "التعامل المباشر مع المصنع لضمان الشفافية.",
        "الاعتماد على أحدث تقنيات التصنيع العالمية.",
      ],
      features: [
        "شيت PET عالي الجودة.",
        "حلول متكاملة للتعبئة والتغليف تغطي مختلف القطاعات، خاصة الأغذية.",
      ],
      mission: [
        `جودة فائقة بأسعار تنافسية`,
        `التعامل المباشر مع المصنع لضمان الشفافية`,
        ` الاعتماد على أحدث تقنيات التصنيع العالمية`,
      ],
      phone: "0120 6000 125",
      website: "www.pureplast.net",
      address:
        "القطعة رقم 254 المنطقة الصناعية (A) مجتمع الخاطر من رمضان الشرقية.",
      img_url: "/IMG_2631-1-scaled-1.jpg",
      products: [
        " شيت PET عالي الجودة.",
        "حلول متكاملة للتعبئة والتغليف تناسب مختلف القطاعات، خاصة الأغذية",
      ],
    },
    {
      name: "مصنع السويس ألياف البوليستر",
      description:
        "تأسست شركة السويس لألياف البوليستر عام 2009 كأول مصنع في الشرق الأوسط متخصص في إنتاج ألياف البوليستر وشرائط التجزيع البلاستيكية من مواد معاد تدويرها. تقع الشركة في المنطقة الصناعية بحي عتاقة، محافظة السويس، وتغطي مساحة 16,425 متر مربع.",
      products: [
        "ألياف بوليستر متنوعة (بالات أو رولات) بألوان متعددة.",
        "شرائط تجزيع بلاستيكية عالية الجودة.",
        "قابير والذي يستخدم في صناعة الملابس والمراتب والسجاد والوسائد وأغطية النوم (اللحاف).",
      ],
      target_markets: [
        " السوق المحلي تغطية شاملة لجميع أنحاء الجمهورية.",
        " السوق الخارجي تصدير إلى أكثر من 12 دولة، بما في ذلك فرنسا ، تركيا ، إسبانيا ، وإيطاليا.",
      ],
      certifications: [
        "ISO 9001",
        "OEKO - TEX STANDARD 100 ",
        "Global Recycled Standard",
      ],
      mission: [
        `نلتزم بدعم الاقتصاد والاستدامة البيئية من خلال إنتاج ألياف بوليستر ومنتجات بلاستيكية مبتكرة وصديقة للبيئة، تساهم في تحسين
البيئة وخدمة المجتمع.`,
      ],

      phone: "0127 996 15 07",
      img_url: "/repreve-unifi-recycled-polyester-factory-tour.jpg",
      address:
        "السويس حي عتاقة المنطقة الصناعية بالادبية قطعة 74-75-76 خلف مصنع السويس للصلب مدخل السعدي",
    },
    {
      name: "شركة SUS للأنظمة الأمنية",
      description:
        "نحن شركة Security & U.S. نعمل في مجال التيار الخفيف والأنظمة الأمنية منذ أكثر من 10 سنوات.",
      advantages: [
        "توريد وتركيب وتطوير أكثر من 140 فرع لمعاهد الدخل على مستوى الجمهورية مع توفير خدمات صيانة على مدار 24 ساعة.",
        "توريد الأنظمة الأمنية لمجموعة من المستشفيات الحكومية والخاصة، منها: معهد ناصر، مستشفى بلغا/س، تحفيز غرف العمليات بأحدث الأنظمة.",
        "المشاركة في أعمال تطوير مترو الثقافة من خلال الأنظمة الأمنية.",
        "الإشراف والتشغيل في أماكن حساسة مثل: مكتب النائب العام، وزارة الداخلية.",
        "تجهيز غرف العمليات بأحدث الأنظمة.",
      ],
      services: [
        "أنظمة المراقبة.",
        "الإنتركم",
        "السنترالات.",
        "أجهزة الحضور والانصراف وأجهزة التحكم في الدخول (Access Control).",
        `أجهزةالإنذار`,
        "أنظمة الصوت (Sound Systems).",
      ],
      address:
        "21 شارع فهمي مشروع من باب اللوق- أمام الفرقة التجارية - وسط البلد - القاهرة",
      phone: "010 166 25 27",
      img_url:
        "/Integrated-Security-Management-Systems-ISMS-shutterstock_146057678.jpg",
    },
    {
      name: "FOX SIGN",
      description:
        "فوكس ساين هي واحدة من أبرز الشركات في مصر والشرق الأوسط المتخصصة في استيراد خامات الدعاية والإعلان. نعمل على تقديم مواد عالية الجودة تلبي احتياجات السوق المحلي والإقليمي، مع التركيز على الابتكار والجودة لخدمة صناعة الإعلان.",
      products: ["بانر.", "فليكس.", "فينيل.", "سي ثرو.", "بانر عاكس."],
      goals: [
        "تحقيق الريادة في سوق خامات الدعاية والإعلان خلال 5 سنوات.",
        "تنوع المنتجات لتلبية احتياجات جميع العملاء.",
        "ضمان الجودة والموثوقية من خلال اختيار أفضل الموردين العالميين.",
        "توفير خدمات توصيل ودعم فني مميزين.",
        "التطوير المستمر لمواجهة أحدث التحديات السوقية.",
      ],
      phone: "0127 996 15 07",
      address: "۱ ش سليم الأول - ميدان حلمية الزيتون",
      img_url: "/405939716_787874746685810_4023399380978356763_n.jpg",
      vision:
        "الريادة في مجال خامات الدعاية والإعلان في مصر والشرق الأوسط، من خلال تقديم منتجات متميزة بأسعار تنافسية ودعم تطور الصناعة بأحدث المواد والتقنيات.",
    },
    {
      name: "MixMax for Touch Screen",
      description:
        "شركة متخصصة في توريد أحدث الشاشات التفاعلية (اللمسية) المصممة خصيصًا لقطاع الدعاية والإعلان. تقدم الشركة حلولاً متكاملة وضماناً لعرض المحتوى التفاعلي، سواء من خلال البيع أو التأجير، لتلبية احتياجات العملاء في مختلف القطاعات.",
      services: [
        "بيع الشاشات التفاعلية: توفير شاشات بتصاميم متكاملة وجودة عالية تناسب احتياجات العملاء.",
        "تأجير الشاشات التفاعلية: دعم الشركات والمؤسسات في فعالياتها ومعارضها من خلال تأجير الشاشات بمختلف الأحجام والمواصفات.",
      ],
      target_sectors: [
        "المعارض والمؤتمرات",
        "المولات التجارية والفنادق",
        "المطاعم التجارية والمنافذ.",
        "المستشفيات والعيادات الطبية.",
        "معارض الأثاث ومعارض السيارات.",
      ],
      img_url: "/images-1.jpg",
      phone: "0100 885 1 885",
      mission: [
        `تقديم خدمات بيع وتأجير الشاشات التفاعلية بطرق تضمن تحسين تجارب العملاء في القطاعات المختلفة، من خلال دمج التكنولوجيا المتطورة التي تساهم في تسهيل
التواصل ورفع كفاءة العرض التفاعلي.`,
      ],

      vision:
        "أن نكون الشريك الرائد في توفير حلول الشاشات التفاعلية الذكية، مع التركيز على الابتكار والجودة لتلبية احتياجات السوق المصري والعالمي.",
    },
    {
      name: "الشركة المتحدة للتجارة والتوكيلات",
      description:
        "شركة مصرية تأسست منذ أكثر من 25 عامًا، وبدأت في مجال التيار الضعيف والبطاريات الجافة، كما تقدم العديد من التوكيلات التجارية.",
      advantages: [
        "الجودة والضمان: هدفنا هو تقديم أفضل جودة ممكنة مع ضمان المنتج لفترة خاصة بعد الشراء.",
        "الخبرة: لدينا أكثر من 25 عامًا من الخبرة التي تمنحنا القدرة على تقديم أفضل الحلول بأعلى دقة.",
        "خدمة ما بعد البيع والصيانة: تقدم خدمات إصلاح وصيانة مستمرة للحفاظ على جودة المنتجات وتحقيق تجربة مرضية للعملاء.",
        "ثقة العميل في العلاقة التجارية: نؤمن بأن الثقة هي أساس العلاقة مع عملائنا، ولذلك نحرص على تقديم خدمات دقيقة وموثوقة.",
      ],
      mission: [
        "نؤمن بحياة أفضل وأكثر تطوراً للمجتمع والعملاء من خلال تقديم منتجات مصرية حديثة، نسعى إلى التوسع في جميع الإلكترونيات المرئية والسمعية التي تواجه التطور، من خلال بناء فريق عمل متميز وكوادر ذات كفاءة عالية، مع التواجد في أسواق جديدة ومنافذ توزيع على مستوى الجمهورية لتوسيع النطاق التجاري وتحقيق الزيادة في الحصة السوقية، نهدف لأن نكون الخيار الأول للعملاء من خلال تقديم منتجات مبتكرة ومجموعة.",
      ],
      phones: ["01211275552", "01211267779", "01211275551"],
      address: "شارع فهمي - صيدناوي الشهير باب اللوق وسط البلد",
      img_url: "/PC-components-User2Computers.jpeg",
    },
    {
      name: "LAND OF GOLD",
      description:
        "شركة متخصصة في بيع المصوغات الذهبية. رؤيتنا أن تكون أرض الذهب الوجهة الأولى للمصوغات الراقية التي تجمع بين الأصالة والجودة. نهدف إلى تقديم مصوغات ذهبية فريدة بجودة عالية وتصاميم تلائم جميع الأذواق.",
      mission: [
        "تقديم تصاميم متنوعة تجمع بين الكلاسيكية والعصرية.",
        "بناء ثقة العملاء من خلال جودة المنتجات والخدمة.",
        "تلبية تطلعات العملاء بتقديم تصاميم حسب الطلب.",
      ],
      vision:
        "تقديم مصوغات ذهبية فريدة بجودة عالية وتصاميم تلائم جميع الأذواق.",
      phones: ["011 44 50 11 93", "0111 67 29 55 3", "0114 88 6 44 81"],
      address: "5 ش سيدي جابر - ميدان الجامع - مصر الجديدة",
      img_url: "/file.jpg",
    },
    {
      name: "موقع أخبار الطب",
      description: `تأسس موقع أخبار الطب سنة ۲۰۱۸ حيث ساهم فيه نخبة من أمهر الأطباء والمتخصصين الذين لم
يبخلوا بالمعلومة الصحية والطبية على الجمهور وخصوصا في فترة من أحلك الفترات التي عاشتها
البشرية والتي حاربنا فيها جميعا يدا بيد كوفيد 19 وهنا كانت نقلة نوعية في سبل التواصل
والتعاون مع الأطباء أون لاين`,
      advantages: [
        `تقديم محتوى طبي موثوق وتنظيم فعاليات طبية لرفع الوعي الصحي وتعزيز الثقافة الطبية.`,
      ],
      vision: `أن تكون "أخبار الطب المنصة الأولى للمعلومات الطبية الموثوقة ولتواصل الأطباء مع المجتمع.`,
      mision: [
        `تنظيم فعاليات طبية لتبادل الخبرات.`,
        ` استضافة أطباء لتقديم محتوى طبي دقيق.`,
        `نشر الوعي الصحي بمعلومات طبية متنوعة.`,
      ],
      phone: "0120 29 29 99 2",
      website: "http://www.ahkbaraltib.com/",
      address: "حدائق الأهرام البوابة الثانية القديمة 5 ل الدور التاني",
      img_url: "/mrg5.png",
    },
    {
      name: "شركة ITC لتنظيم المؤتمرات والفعاليات الطبية",
      description: `تقدم شركة ITC خدمات مخصصة لتنظيم الفعاليات والمؤتمرات في المجالات الطبية، العلمية، التجارية، والاجتماعية محليا ودوليا.
بفضل خبرتنا الطويلة، نقوم بدقة وعناية بتصميم وإدارة كل فعالية بحماس، شغف، دقة احترافية وتميز تبدأ مهمتنا من إيجاد
المكان المناسب، والإعلان، وتوفير الرعاة، وتسهيل الاجتماعات، والترفيه المؤسسي، إلى تسهيلات السفر، التأشيرات والإقامة.
باختصار، يمكننا إدارة فعاليتك من الفكرة إلى التنفيذ. يلتزم فريقنا الخبير بفهم احتياجاتك الخاصة وضمان حصول كل ضيف من ضيوفك على تجربة
فريدة لا تنسى. مع هيكل تنظيمي احترافي.`,
      vision: `نطمح لأن نكون الشركة الرائدة في إدارة الفعاليات في مصر والشرق الأوسط من خلال تنفيذ أكثر الفعاليات تميزا ، وأن نكون الأكثر إبداعا والتزاما
بتحقيق أهداف عملائنا.`,
      // mission: [
      //   `تقديم تجارب شخصية وفريدة من نوعها من خلال التركيز على كل تفاصيل الفعالية وضمان رضا عملائنا التام.`,
      // ],
      goals: [
        `تلبية احتياجات العملاء: نسعى جاهدين إلى تخطيط وتنفيذ مؤتمرات تلبي الاحتياجات والأهداف المحددة لكل عميل على حدة.`,
        ` التميز في إدارة الفعاليات نقدم خدمات إدارة فعاليات استثنائية، تضمن سلاسة الإجراءات اللوجستية، وكفاءة التنظيم، وتنفيذ فعال لا تشوبه شائبة.`,
        `خلق تجارب لا تنسى: نسعى إلى تقديم تجارب مؤتمرات جذابة ومؤثرة تترك انطباعًا دائما لدى الحضور.`,
        ` بناء علاقات قوية : نعمل على بناء علاقات قوية مع العملاء والشركاء والموردين، مبنية على الثقة والتعاون والاحترافية.`,
        ` الابتكار والتطوير نبقى على اطلاع دائم بأحدث الاتجاهات والتكنولوجيات في مجال صناعة المؤتمرات، ونقوم بدمج الأفكار والاستراتيجيات المبتكرة في تخطيط
وتنفيذ مؤتمراتنا.`,
        `تحسين الأداء المستمر: نسعى باستمرار إلى تحسين عملياتنا وإجراءاتنا ، ونسعى إلى تحقيق التميز في جميع جوانب تنظيم المؤتمرات.`,
        `تجاوز توقعات العملاء: نتجاوز توقعات عملائنا من خلال تقديم خدمة عملاء استثنائية، وتواصل استباقي، وحل سريع لأي مشاكل أو مخاوف.`,
        `الريادة في السوق: نسعى إلى ترسيخ مكانة شركتنا كاسم موثوق به في مجال تنظيم المؤتمرات، معروف بتقديم فعاليات عالية الجودة`,
      ],
      address: "82 مكرم عبيد ، مدينة نصر",
      img_url: "/itc.png",
    },
  ],
};

const AboutPage = () => {
  return (
    <section className="pt-32 pb-16 bg-green-50">
      <h2 className="text-zinc-900 text-center text-4xl font-medium leading-loose">
        اهم الشركات
      </h2>

      <div className="container mx-auto px-4 lg:px-8 mb-12">
        <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
          <img
            src="/mrg7.jpg"
            className="object-cover w-full h-96 rounded-xl"
            alt="MRG Image 1"
          />
          <img
            src="/mrg4.png"
            className="object-cover w-full h-96 rounded-xl"
            alt="MRG Image 2"
          />
        </div>
      </div>

      <div className="container mx-auto px-4 lg:px-16">
        <h2 className="text-zinc-900 text-center text-4xl font-medium leading-loose">
          شركات اخرى
        </h2>

        <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 xl:grid-cols-4 gap-6">
          {companiesData.companies.map((company, index) => (
            <Card
              key={index}
              id={company.id ?? index}
              company_name={company.name}
              description={company.description}
              img_url={company.img_url}
              website={company.website || ""}
              vision={companiesData.vision}
              goals={company.goals || []}
              mission={company.mission || ""}
              phone={company.phone || ""}
              address={company.address || ""}
              products={company.products || []}
              services={company.services || []}
              values={company.values || []}
              branches={company.branches || []}
              training_fields={company.training_fields || []}
              advantages={company.advantages || []}
              target_sectors={company.target_sectors || []}
              certifications={company.certifications || []}
              target_markets={company.target_markets || []}
              email={company.email || ""}
            />
          ))}
        </div>
      </div>
    </section>
  );
};

export default AboutPage;
